In [2]:
import pandas as pd
details= {
    'Name' : ['Sruthi', 'Ali', 'Alen', 'Megha'],
    'Age' : [23, 22, 21, 20],
    'University' : ['ku', 'ktu', 'cusat', 'mg']
}
df=pd.DataFrame(details)
df1 = df.head(2)
print(df1)

     Name  Age University
0  Sruthi   23         ku
1     Ali   22        ktu

In [3]:
import pandas as pd
data= {
    'Name' : ['Sundu','Alen','Yaduk','Navya'],
    'Occupation':['Teacher','Engineer','Engineer','Teacher'],
    'Salary':[20000,34000,45000,45555]
}
df=pd.DataFrame(data)
print(df)
Salary_average= df.groupby('Occupation')['Salary'].mean() 

print(Salary_average)

    Name Occupation  Salary
0  Sundu    Teacher   20000
1   Alen   Engineer   34000
2  Yaduk   Engineer   45000
3  Navya    Teacher   45555
Occupation
Engineer    39500.0
Teacher     32777.5
Name: Salary, dtype: float64

In [4]:
import pandas as pd
import numpy as np
data= {
    'Name' : ['Megha','Anusha','Ali','KK'],
    'Id' : [1,2,3,4],
    'Phone Number':[np.nan,90742767,673378732,np.nan]
}
df=pd.DataFrame(data)
print(df) 



df_nullfill = df.fillna(0)

print(df_nullfill)

     Name  Id  Phone Number
0   Megha   1           NaN
1  Anusha   2    90742767.0
2     Ali   3   673378732.0
3      KK   4           NaN
     Name  Id  Phone Number
0   Megha   1           0.0
1  Anusha   2    90742767.0
2     Ali   3   673378732.0
3      KK   4           0.0

In [5]:


import pandas as pd
import numpy as np
data= {
    'cname' : ['Wipro','Cognizant','Mphasis','UST'],
    'profit' : [1000000,2000000,-31110,-43000]
}
df=pd.DataFrame(data)
print(df)
print()
print()
df['profit'] = df['profit'].apply(lambda x:x>0)
print(df)

       cname   profit
0      Wipro  1000000
1  Cognizant  2000000
2    Mphasis   -31110
3        UST   -43000


       cname  profit
0      Wipro    True
1  Cognizant    True
2    Mphasis   False
3        UST   False

In [6]:
import pandas as pd
import numpy as np
data1= {
    'eid' : [1001,1002,1003,1004],
    'ename' : ['Anu','Anju','Anand','Ali'],
    'stipend' : [10000,20000,13000,15000]
}
data2= {
    'eid' : [1001,1002,1003,1004],
    'designation' : ['senior manager','sales manager','manager','clerk']
}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print()
print()
print(df2)
print()
print()
dataframe = pd.merge(df1, df2, how = 'inner', on = 'eid')
print(dataframe)

    eid  ename  stipend
0  1001    Anu    10000
1  1002   Anju    20000
2  1003  Anand    13000
3  1004    Ali    15000


    eid     designation
0  1001  senior manager
1  1002   sales manager
2  1003         manager
3  1004           clerk


    eid  ename  stipend     designation
0  1001    Anu    10000  senior manager
1  1002   Anju    20000   sales manager
2  1003  Anand    13000         manager
3  1004    Ali    15000           clerk